In [2]:
import numpy as np
import pandas as pd

from pandas import DataFrame, Series
from numpy.random import randn

In [3]:
dframe = DataFrame({'Key1': ['X','X','Y','Y','Z'], 
                   'Key2': ['alpha','beta','alpha','beta','alpha'],
                   'd1': randn(5), 'd2': randn(5)})

In [4]:
dframe

  Key1   Key2        d1        d2
0    X  alpha -0.465125  0.041505
1    X   beta -1.586067 -0.176195
2    Y  alpha -0.189207 -0.918516
3    Y   beta  0.576000 -1.357422
4    Z  alpha  1.360970  0.856825

In [5]:
group = dframe['d1'].groupby(dframe['Key1'])

In [6]:
group

In [7]:
group.mean()

Key1
X   -1.025596
Y    0.193396
Z    1.360970
Name: d1, dtype: float64

In [8]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['Jan','Feb','Jan','Feb','Jan'])

In [9]:
dframe['d1'].groupby([cities,month]).mean()

LA  Feb   -1.586067
    Jan   -0.189207
NY  Feb    0.576000
    Jan    0.447923
Name: d1, dtype: float64

In [10]:
dframe

  Key1   Key2        d1        d2
0    X  alpha -0.465125  0.041505
1    X   beta -1.586067 -0.176195
2    Y  alpha -0.189207 -0.918516
3    Y   beta  0.576000 -1.357422
4    Z  alpha  1.360970  0.856825

In [11]:
 dframe.groupby('Key1').mean()

            d1        d2
Key1
X    -1.025596 -0.067345
Y     0.193396 -1.137969
Z     1.360970  0.856825

In [12]:
 dframe.groupby(['Key1','Key2']).mean()

                  d1        d2
Key1 Key2
X    alpha -0.465125  0.041505
     beta  -1.586067 -0.176195
Y    alpha -0.189207 -0.918516
     beta   0.576000 -1.357422
Z    alpha  1.360970  0.856825

In [13]:
dframe

  Key1   Key2        d1        d2
0    X  alpha -0.465125  0.041505
1    X   beta -1.586067 -0.176195
2    Y  alpha -0.189207 -0.918516
3    Y   beta  0.576000 -1.357422
4    Z  alpha  1.360970  0.856825

In [14]:
for name,group in dframe.groupby('Key1'):
    print (('this is %s group'%name))
    print (group)
    print ('\n')

this is X group
  Key1   Key2        d1        d2
0    X  alpha -0.465125  0.041505
1    X   beta -1.586067 -0.176195


this is Y group
  Key1   Key2        d1        d2
2    Y  alpha -0.189207 -0.918516
3    Y   beta  0.576000 -1.357422


this is Z group
  Key1   Key2       d1        d2
4    Z  alpha  1.36097  0.856825

In [15]:
dframe.groupby(['Key1']).size()

Key1
X    2
Y    2
Z    1
dtype: int64

In [16]:
for (Key1,Key2), group in dframe.groupby(['Key1','Key2']):
    print ('Key1 = %s Key2 = %s' %(Key1,Key2))
    print( group)
    print('\n')

Key1 = X Key2 = alpha
  Key1   Key2        d1        d2
0    X  alpha -0.465125  0.041505


Key1 = X Key2 = beta
  Key1  Key2        d1        d2
1    X  beta -1.586067 -0.176195


Key1 = Y Key2 = alpha
  Key1   Key2        d1        d2
2    Y  alpha -0.189207 -0.918516


Key1 = Y Key2 = beta
  Key1  Key2     d1        d2
3    Y  beta  0.576 -1.357422


Key1 = Z Key2 = alpha
  Key1   Key2       d1        d2
4    Z  alpha  1.36097  0.856825

In [17]:
dframe

  Key1   Key2        d1        d2
0    X  alpha -0.465125  0.041505
1    X   beta -1.586067 -0.176195
2    Y  alpha -0.189207 -0.918516
3    Y   beta  0.576000 -1.357422
4    Z  alpha  1.360970  0.856825

In [19]:
group_dict = dict(list(dframe.groupby('Key1')))

In [21]:
group_dict['X']

  Key1   Key2        d1        d2
0    X  alpha -0.465125  0.041505
1    X   beta -1.586067 -0.176195